##### t-검정(일표본 검증)
# a병원에서 치료한 성인 여성 감기 환자들의 치유 기간 데이터
data <- c(5,6,7,5,5,9,10,3,3,3.5,8,8,7,2,3,3.5,6,6,6,6)

# 모평균이 7보다 적은지 검정
t.test(data, mu = 7, alternative = 'less')
#p-value = 0.004881/  p-value 가 0.05보다 작으므로 귀무가설 기각
# 모집단의 평균 치유기간은 7보다 작다.

##### t-검정(대응이표본검정)
before <- c(68.12,56.934,57.36,54.64,64.33,48.49,68.72, 56.19, 61.6,58.75,67.31,49.7,58.39,58.08,65.67,54.5,59.14,55.61,60.21,62.91)
after <- c(65.90,54.79,57.82,54.64,64.84,47.34,67.87,54.58,60.65,58.79,65.71,48.81,57,56.52,64.13,53.94,57.22,55.32,61.61,63.22)

t.test(before, after,paired = TRUE, var.equal = TRUE, alternative = 'greater') #단측검정으로 before 데이터가 더 큰지 검정하므로 greater

##### t-검정(독립이표본검정)
seoul <- c(43.12, 40.94, 42.36,50.64,50,43.49,43,40,40.19,46.6,43.75,42.31,44.7,43.39,33.08,40.67, 49.5,34.14,40,35,37)
busan <- c(41,42,40,28,49,40,43,40,56,43,51,44,42,32,39,49,33,40,36,38)

t.test(seoul,busan,paired = FALSE, var.equal = FALSE, alternative = 'two.sided')

##### 분산분석(일원분산분석)
anova_result <- aov(Sepal.Length ~ Species, data = iris)
summary(anova_result)
